In [10]:
import numpy as np 
import pandas as pd
import matplotlib as mat
import seaborn as sns

In [11]:
df = pd.read_csv(r"C:\Users\akhil\Downloads\Social_Network_Ads.csv")
df.head()
from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import MinMaxScaler
 
le = LabelEncoder()
df.isnull().sum()
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [12]:
from sklearn.model_selection import train_test_split
x = df.drop(labels ="Purchased", axis=1)
y = df["Purchased"]
x

      User ID  Gender  Age  EstimatedSalary
0    15624510    Male   19            19000
1    15810944    Male   35            20000
2    15668575  Female   26            43000
3    15603246  Female   27            57000
4    15804002    Male   19            76000
..        ...     ...  ...              ...
395  15691863  Female   46            41000
396  15706071    Male   51            23000
397  15654296  Female   50            20000
398  15755018    Male   36            33000
399  15594041  Female   49            36000

[400 rows x 4 columns]

In [13]:
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.2, random_state=42)

In [14]:
x

      User ID  Gender  Age  EstimatedSalary
0    15624510    Male   19            19000
1    15810944    Male   35            20000
2    15668575  Female   26            43000
3    15603246  Female   27            57000
4    15804002    Male   19            76000
..        ...     ...  ...              ...
395  15691863  Female   46            41000
396  15706071    Male   51            23000
397  15654296  Female   50            20000
398  15755018    Male   36            33000
399  15594041  Female   49            36000

[400 rows x 4 columns]

In [15]:
y

0      0
1      0
2      0
3      0
4      0
      ..
395    1
396    1
397    1
398    0
399    1
Name: Purchased, Length: 400, dtype: int64

In [25]:
X = df[['Age', 'EstimatedSalary']]
y = df['Purchased']

In [27]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

In [28]:
from sklearn.linear_model import LinearRegression
le = LinearRegression()
le.fit(X_train, y_train)
pred = le.predict(X_test)
pred

array([ 0.36269954,  0.97356109, -0.00371156,  0.72662375, -0.04583675,
        0.12344117,  0.74760863,  0.18670667,  0.43364401,  0.442411  ,
        0.26374437,  0.59210291, -0.11441833, -0.2966913 ,  0.22914272,
        0.44555105,  0.58349136,  0.58255877,  0.26859416,  0.77860394,
       -0.22873144,  0.17402248,  0.39245141,  0.92282435, -0.33912735,
        0.49454662,  0.50583193,  0.26405523,  1.02790418, -0.33067122,
        0.44303272, -0.12349618,  0.62328509,  0.14427062,  0.568942  ,
        0.30602499,  0.27251136,  0.34031578, -0.11395204, -0.15747611,
        0.46025583, -0.05929809, -0.2251251 ,  0.37976722, -0.18676168,
        0.80633521,  0.0936893 ,  0.18701753,  0.49408033,  0.1452032 ,
        0.0676992 ,  0.7950499 ,  0.29803516,  0.07192727,  0.37821291,
       -0.08420017,  1.05827777,  0.25811743,  0.19970172,  0.20815784,
        0.35769433,  0.22991988,  0.80335059,  0.17809511,  0.05970937,
        0.36397442,  0.54811255,  0.90404693,  0.34047121,  0.41564375,
        1.00629758, -0.06007524,  0.02995751, -0.23280407,  0.43896009,
        0.20032344,  1.08725248,  0.58380222,  0.18763925,  0.36975679])

In [29]:
from sklearn.metrics import mean_absolute_error

print(f"Mean Absolute Error: {mean_absolute_error(y_test, pred)}")
from sklearn.metrics import mean_squared_error
print(f"Mean Squared Error: {mean_squared_error(y_test, pred)}")

Mean Absolute Error: 0.2655035494352019
Mean Squared Error: 0.09929708810652678

In [30]:
residual_error = y_test - pred
print(residual_error)

209   -0.362700
280    0.026439
33     0.003712
210    0.273376
93     0.045837
         ...
246   -0.200323
227   -0.087252
369    0.416198
176   -0.187639
289    0.630243
Name: Purchased, Length: 80, dtype: float64